colinporth/nRF5_SDK_15.2.0/components/drivers_ext/sx1509b/sx1509b.h
#pragma once
#include "nrf_twi_sensor.h"
#include "sx1509b_internal.h"
//{{{
#ifdef __cplusplus
extern "C" {
#endif
//}}}

#define SX1509B_BASE_ADDRESS_FIRST   0x3Eu
#define SX1509B_BASE_ADDRESS_SECOND  0x3Fu
#define SX1509B_BASE_ADDRESS_THIRD   0x70u
#define SX1509B_BASE_ADDRESS_FOURTH  0x71u

typedef enum { SX1509B_LED_DRIVER_T_ON, SX1509B_LED_DRIVER_I_ON, SX1509B_LED_DRIVER_OFF,
               SX1509B_LED_DRIVER_T_RISE, SX1509B_LED_DRIVER_T_FALL
               } sx1509b_led_driver_set_t;
typedef enum {  SX1509B_PIN_DIR_OUTPUT, SX1509B_PIN_DIR_INPUT } sx1509b_pin_dir_t;
typedef enum { SX1509B_PIN_CLR, SX1509B_PIN_SET } sx1509b_pin_set_t;
typedef enum { SX1509B_PIN_NOPULL, SX1509B_PIN_PULLDOWN, SX1509B_PIN_PULLUP } sx1509b_pin_pull_t;
typedef enum { SX1509B_PIN_NOSENSE, SX1509B_PIN_SENSE_RISING, SX1509B_PIN_SENSE_FALLING, SX1509B_PIN_SENSE_BOTH } sx1509b_pin_sense_t;
typedef enum { SX1509B_PORT_WRITE, SX1509B_PORT_CLEAR, SX1509B_PORT_SET } sx1509b_port_op_t;
typedef enum { SX1509B_LEVEL_OFF, SX1509B_LEVEL_A_TO_B, SX1509B_LEVEL_B_TO_A } sx1509b_level_shift_t;
typedef enum { SX1509B_DEBOUNCE_0_5MS, SX1509B_DEBOUNCE_1MS, SX1509B_DEBOUNCE_2MS, SX1509B_DEBOUNCE_4MS,
               SX1509B_DEBOUNCE_8MS, SX1509B_DEBOUNCE_16MS, SX1509B_DEBOUNCE_32MS, SX1509B_DEBOUNCE_64MS
               } sx1509b_debounce_t;
typedef enum { SX1509B_CLOCK_DISABLED, SX1509B_CLOCK_EXTERNAL, SX1509B_CLOCK_INTERNAL } sx1509b_clock_t;
typedef enum { SX1509B_KEY_TIME_SLEEP_OFF, SX1509B_KEY_TIME_SLEEP_128MS, SX1509B_KEY_TIME_SLEEP_256MS, SX1509B_KEY_TIME_SLEEP_512MS,
               SX1509B_KEY_TIME_SLEEP_1S, SX1509B_KEY_TIME_SLEEP_2S, SX1509B_KEY_TIME_SLEEP_4S, SX1509B_KEY_TIME_SLEEP_8S
               } sx1509b_key_sleep_t;
typedef enum { SX1509B_KEY_TIME_SCAN_1MS, SX1509B_KEY_TIME_SCAN_2MS, SX1509B_KEY_TIME_SCAN_4MS, SX1509B_KEY_TIME_SCAN_8MS,
               SX1509B_KEY_TIME_SCAN_16MS, SX1509B_KEY_TIME_SCAN_32MS, SX1509B_KEY_TIME_SCAN_64MS, SX1509B_KEY_TIME_SCAN_128MS
               } sx1509b_key_scan_t;

#define SX1509B_INSTANCES_DEF_START (sx1509b_inst_name, instance_count) static sx1509b_instance_t sx1509b_inst_name[instance_count]

void sx1509b_init (sx1509b_instance_t* p_instances, uint8_t count);

//{{{
/**
 * @brief Function adding expander instance.
 * @note Should be called for every connected expander.
 *       Order of calls define order of pins and ports.
 * @param[in] p_twi_sensor   Pointer to common sensor instance. @ref NRF_TWI_SENSOR_DEF
 * @param[in] sensor_address Address of expander on I2C bus.
 * @retval NRF_ERROR_MODULE_NOT_INITIALIZED Returned if expander module wasn't initialised
 * @retval NRF_ERROR_STORAGE_FULL           Returned if trying to add more instances than defined.
 * @retval other                            Return error code from nrf_twi_sensor
 *                                          @ref nrf_twi_sensor_write
 */
ret_code_t sx1509b_add_instance (nrf_twi_sensor_t* p_twi_sensor, uint8_t sensor_address);
//}}}
//{{{
/**
 * @brief Function for writing current configuration to expander.
 * @param[in] instance_num Number of expander, order is the same as sx1509b_add_instance calls.
 * @retval NRF_ERROR_INVALID_PARAM Returned if there is no expander with given number.
 * @retval other                   Return error code from nrf_twi_sensor @ref nrf_twi_sensor_write
 */
ret_code_t sx1509b_cfg_write (uint8_t instance_num);
//}}}
//{{{
/**
 * @brief Function for reading current configuration of expander.
 *
 * @retval NRF_ERROR_INVALID_PARAM Returned if there is no expander with given number.
 * @retval other                   Return error code from nrf_twi_sensor @ref nrf_twi_sensor_write
 */
ret_code_t sx1509b_cfg_read (uint8_t instance_num);
//}}}
//{{{
/**
 * @brief Function for setting clock configuration.
 *
 * @param instance_num Number of expander.
 * @param source       Clock source.
 * @param oscio_set    Oscio pin setting. True if pin is enabled.
 * @param oscio_freq   Oscio frequency divider. Refer to expander documentation.
 *
 * @retval NRF_ERROR_INVALID_PARAM Returned if there is no expander with given number.
 * @retval other                   Return error code from nrf_twi_sensor @ref nrf_twi_sensor_write
 */
ret_code_t sx1509b_clock_set (uint8_t instance_num,
                             sx1509b_clock_t source,
                             bool            oscio_set,
                             uint8_t         oscio_freq);
//}}}
//{{{
/*
 * @brief Function for setting nreset and debounce time.
 *
 * @param instance_num   Number of expander.
 * @param nreset_func    Purpose of nreset pin.
 * @arg   true           Pin resets PWM/Blink/Fade counters.
 * @arg   false          Pin is equivalent to POR.
 * @param debounce_time  Debounce time setting.
 * @param autoclear_nint Autoclear nint and interrupt source registers when pin data is read.
 *                       True if disabled.
 *
 * @retval NRF_ERROR_INVALID_PARAM Returned if there is no expander with such number.
 * @retval other                   Return error code from nrf_twi_sensor @ref nrf_twi_sensor_write
 */
ret_code_t sx1509b_misc_set (uint8_t nstance_num,
                            bool               nreset_func,
                            sx1509b_debounce_t debounce_time,
                            bool               autoclear_nint);
//}}}
//{{{
/**
 * @brief Function sending software reset command to expander.
 *
 * @param instance_num Number of expander.
 *
 * @retval NRF_ERROR_INVALID_PARAM Returned if there is no expander with such number.
 * @retval other                   Return error code from nrf_twi_sensor @ref nrf_twi_sensor_write
 */
ret_code_t sx1509b_sw_reset (uint8_t instance_num);
//}}}

//{{{
/**
 * @brief Function for setting register configuration of a single pin.
 *
 * @param[in] reg Register address, if register has two banks, address of bank B has to be used.
 * @param[in] pin Pin number.
 * @param[in] set Value to set.
 *
 * @retval NRF_ERROR_INVALID_PARAM Returned if there is no pin with such number.
 * @retval other                   Return error code from nrf_twi_sensor @ref nrf_twi_sensor_write
 */
ret_code_t sx1509b_pin_cfg_reg_set (sx1509b_registers_t reg, uint32_t pin, uint8_t set);
//}}}
//{{{
/**
 * @brief Function for getting register configuration of a single pin.
 *
 * @param[in] reg Register address, if register has two banks, address of bank B has to be used.
 * @param[in] pin Pin number.
 *
 * @retval 0xFF  Returned if there is no pin with given number.
 * @return other Pin setting value at given register.
 */
uint8_t sx1509b_pin_cfg_reg_get (sx1509b_registers_t reg, uint32_t pin);
//}}}
//{{{
/**
 * @brief Function for updating pin data.
 *
 * @param user_cb Function to be called after pin data update is done.
 *
 * @return Return error code from nrf_twi_sensor @ref nrf_twi_sensor_reg_read
 */
ret_code_t sx1509b_pin_data_update (nrf_twi_sensor_reg_cb_t user_cb);
//}}}
//{{{
/**
 * @brief Function for updating latch data.
 *
 * @param user_cb Function to be called after latch update is done.
 *
 * @return Return error code from nrf_twi_sensor @ref nrf_twi_sensor_reg_read
 */
ret_code_t sx1509b_pin_latch_update (nrf_twi_sensor_reg_cb_t user_cb);
//}}}

