colinporth/nRF5_SDK_15.2.0/components/drivers_ext/sx1509b/sx1509b.h
//{{{
/**
 * @brief Function for setting long slew for given pin.
 *
 * @param pin_number Pin number.
 * @param set        Long slew setting.
 * @arg   true       Long slew is enabled.
 * @arg   false      Long slew is disabled.
 *
 * @return Return error code from pin config set @ref sx1509b_pin_cfg_reg_set
 */
__STATIC_INLINE ret_code_t sx1509b_pin_long_slew (uint32_t pin_number, bool set);
//}}}
//{{{
/**
 * @brief Function for setting low drive for given pin.
 *
 * @param pin_number Pin number.
 * @param set        Low drive setting.
 * @arg   true       Low drive is enabled.
 * @arg   false      Low drive is disabled.
 *
 * @return Return error code from pin config set @ref sx1509b_pin_cfg_reg_set
 */
__STATIC_INLINE ret_code_t sx1509b_pin_low_drive (uint32_t pin_number, bool set);
//}}}
//{{{
/**
 * @brief Function for setting open drain for given pin.
 *
 * @param pin_number Pin number.
 * @param set        Open drain setting.
 * @arg   true       Open drain is enabled.
 * @arg   false      Open drain is disabled.
 *
 * @return Return error code from pin config set @ref sx1509b_pin_cfg_reg_set
 */
__STATIC_INLINE ret_code_t sx1509b_pin_open_drain (uint32_t pin_number, bool set);
//}}}
//{{{
/**
 * @brief Function for setting polarity for given pin.
 *
 * @param pin_number Pin number.
 * @param set        Polarity setting.
 * @arg   true       Inverted polarity.
 * @arg   false      Normal polarity.
 *
 * @return Return error code from pin config set @ref sx1509b_pin_cfg_reg_set
 */
__STATIC_INLINE ret_code_t sx1509b_pin_polarity (uint32_t pin_number, bool set);
//}}}
//{{{
/**
 * @brief Function for setting debounce for given pin.
 *
 * @param pin_number Pin number.
 * @param set        Debounce setting.
 * @arg   true       Debouncing is enabled.
 * @arg   false      Debouncing is disabled.
 *
 * @return Return error code from pin config set @ref sx1509b_pin_cfg_reg_set
 */
__STATIC_INLINE ret_code_t sx1509b_pin_debounce (uint32_t pin_number, bool set);
//}}}
//{{{
/**
 * @brief Function for setting level shift for given pin.
 *
 * @param pin_number Pin number.
 * @param set        Level shift setting.
 *
 * @return Return error code from pin config set @ref sx1509b_pin_cfg_reg_set
 */
__STATIC_INLINE ret_code_t sx1509b_pin_level_shifter (uint32_t pin_number, sx1509b_level_shift_t set);
//}}}
//{{{
/**
 * @brief Function for setting high input for given pin.
 *
 * @param pin_number Pin number.
 * @param set        High input setting.
 * @arg   true       High input is enabled.
 * @arg   false      High input is disabled.
 *
 * @retval NRF_ERROR_INVALID_PARAM Returned if there is no pin with such number.
 * @retval other                   Return error code from nrf_twi_sensor @ref nrf_twi_sensor_write
 */
ret_code_t sx1509b_pin_high_input (uint32_t pin_number, bool set);
//}}}
//{{{
/**
 * @brief Function for configuring the given GPIO pin number as input, hiding inner details.
 *        This function can be used to configure a pin as simple input.
 *
 * @param pin_number  Specifies the pin number.
 * @param pull_config State of the pin range pull resistor (no pull, pulled down, or pulled high).
 *
 * @note  Sense capability on the pin is disabled and input is connected to buffer.
 *
 * @return Return error code from pin config set @ref sx1509b_pin_cfg_reg_set
 */
ret_code_t sx1509b_pin_cfg_input (uint32_t pin_number, sx1509b_pin_pull_t pull_config);
//}}}
//{{{
/**
 * @brief Function for resetting pin configuration to its default state.
 *
 * @param pin_number Specifies the pin number.
 *
 * @return Return error code from pin config set @ref sx1509b_pin_cfg_reg_set
 */
ret_code_t sx1509b_pin_cfg_default (uint32_t pin_number);
//}}}
//{{{
/**
 * @brief Function for configuring the given GPIO pin number as a watcher. Only input is connected.
 *
 * @param pin_number Specifies the pin number.
 *
 * @return Return error code from pin config set @ref sx1509b_pin_cfg_reg_set
 */
__STATIC_INLINE ret_code_t sx1509b_pin_cfg_watcher (uint32_t pin_number); // non
//}}}
//{{{
/**
 * @brief Function for disconnecting input for the given GPIO.
 *
 * @param pin_number Specifies the pin number.
 *
 * @return Return error code from pin config set @ref sx1509b_pin_cfg_reg_set
 */
__STATIC_INLINE ret_code_t sx1509b_pin_cfg_input_disconnect (uint32_t pin_number);
//}}}
//{{{
/**
 * @brief Function for configuring the given GPIO pin number as input, hiding inner details.
 *        Sense capability on the pin is configurable and input is connected to buffer.
 *
 * @param pin_number   Specifies the pin number.
 * @param pull_config  State of the pin pull resistor (no pull, pulled down, or pulled high).
 * @param sense_config Sense level of the pin (no sense, sense low, sense high or sense both).
 *
 * @return Return error code from pin config set @ref sx1509b_pin_cfg_reg_set
 */
ret_code_t sx1509b_pin_cfg_sense_input (uint32_t pin_number, sx1509b_pin_pull_t  pull_config, sx1509b_pin_sense_t sense_config);
//}}}
//{{{
/**
 * @brief Function for configuring sense level for the given GPIO.
 *
 * @param pin_number   Specifies the pin number.
 * @param sense_config Sense configuration.
 *
 * @return Return error code from pin config set @ref sx1509b_pin_cfg_reg_set
 */
ret_code_t sx1509b_pin_cfg_sense_set (uint32_t pin_number, sx1509b_pin_sense_t sense_config);
//}}}
//{{{
/**
 * @brief Function for setting the direction for a GPIO pin.
 *
 * @param pin_number Specifies the pin number for which to set the direction.
 * @param direction  Specifies the direction.
 *
 * @return Return error code from pin config set @ref sx1509b_pin_cfg_reg_set
 */
ret_code_t sx1509b_pin_dir_set (uint32_t pin_number, sx1509b_pin_dir_t direction);
//}}}
//{{{
/**
 * @brief Function for setting a GPIO pin.
 *
 * Note that the pin must be configured as an output for this function to have any effect.
 *
 * @param pin_number Specifies the pin number to set.
 *
 * @return Return error code from pin config set @ref sx1509b_pin_cfg_reg_set
 */
__STATIC_INLINE ret_code_t sx1509b_pin_set (uint32_t pin_number);
//}}}
//{{{
/**
 * @brief Function for clearing a GPIO pin.
 *
 * Note that the pin must be configured as an output for this
 * function to have any effect.
 *
 * @param pin_number Specifies the pin number to clear.
 *
 * @return Return error code from pin config set @ref sx1509b_pin_cfg_reg_set
 */
__STATIC_INLINE ret_code_t sx1509b_pin_clear (uint32_t pin_number);
//}}}
//{{{
/**
 * @brief Function for toggling a GPIO pin.
 *
 * Note that the pin must be configured as an output for this
 * function to have any effect.
 *
 * @param pin_number Specifies the pin number to toggle.
 *
 * @return Return error code from pin config set @ref sx1509b_pin_cfg_reg_set
 */
__STATIC_INLINE ret_code_t sx1509b_pin_toggle (uint32_t pin_number);
//}}}
//{{{
/**
 * @brief Function for writing a value to a GPIO pin.
 *
 * Note that the pin must be configured as an output for this
 * function to have any effect.
 *
 * @param pin_number Specifies the pin number to write.
 *
 * @param value Specifies the value to be written to the pin.
 * @arg 0 Clears the pin.
 * @arg >=1 Sets the pin.
 *
 * @return Return error code from pin config set @ref sx1509b_pin_cfg_reg_set
 */
__STATIC_INLINE ret_code_t sx1509b_pin_write (uint32_t pin_number,  sx1509b_pin_set_t value);
//}}}
//{{{
/**
 * @brief Function for reading the input level of a GPIO pin.
 *
 * @note The pin must have input connected for the value
 *       returned from this function to be valid.
 *       Due to specifics of TWI expander, pin data must be updated first
 *       to get current value @ref sx1509b_pin_data_update
 *
 * @param pin_number Specifies the pin number to read.
 *
 * @return 0 if the pin input level is low. Positive value if the pin is high.
 */
__STATIC_INLINE uint32_t sx1509b_pin_read (uint32_t pin_number);
//}}}
//{{{
/**
 * @brief Function for reading the output level of a GPIO pin.
 *
 * @param pin_number Specifies the pin number to read.
 *
 * @return 0 if the pin output level is low. Positive value if pin output is high.
 */
__STATIC_INLINE uint32_t sx1509b_pin_out_read (uint32_t pin_number);
//}}}
//{{{
/**
 * @brief Function for reading the sense configuration of a GPIO pin.
 *
 * @param pin_number Specifies the pin number to read.
 *
 * @retval Sense configuration.
 */
__STATIC_INLINE sx1509b_pin_sense_t sx1509b_pin_sense_get (uint32_t pin_number);
//}}}

