colinporth/nRF5_SDK_15.2.0/components/drivers_ext/sx1509b/sx1509b.h
//{{{
/**
 * @brief Function for setting register configuration of a port.
 *
 * @param reg  Register address, if register has two banks, address of bank B has to be used.
 * @param port Port number.
 * @param mask Mask for the operating.
 * @param flag Operation, should the mask be written into register, clear values or set them.
 *
 * @retval NRF_ERROR_INVALID_PARAM Returned if there is no port with such number.
 * @retval other                   Return error code from nrf_twi_sensor @ref nrf_twi_sensor_write
 */
ret_code_t sx1509b_port_cfg_reg_set (sx1509b_registers_t reg,
                                    uint32_t            port,
                                    uint8_t             mask,
                                    sx1509b_port_op_t   flag);
//}}}
//{{{
/**
 * @brief Function for getting register configuration of a port.
 *
 * @param reg  Register address, if register has two banks, address of bank B has to be used.
 * @param port Port number.
 *
 * @retval Register value.
 */
uint8_t sx1509b_port_cfg_reg_get (sx1509b_registers_t reg, uint32_t port);
//}}}
//{{{
/**
 * @brief Function for setting longslew for given port.
 *
 * @param port_num Port number.
 * @param out_mask Long slew mask.
 * @param flag     Port operation flag. @ref sx1509b_port_op_t
 *
 * @return Return error code from port config set @ref sx1509b_port_cfg_reg_set
 */
__STATIC_INLINE ret_code_t sx1509b_port_long_slew (uint8_t port_num, uint8_t out_mask, sx1509b_port_op_t flag);
//}}}
//{{{
/**
 * @brief Function for setting low drive for given port.
 *
 * @param port_num Port number.
 * @param out_mask Low drive mask.
 * @param flag     Port operation flag. @ref sx1509b_port_op_t
 *
 * @return Return error code from port config set @ref sx1509b_port_cfg_reg_set
 */
__STATIC_INLINE ret_code_t sx1509b_port_low_drive (uint8_t port_num, uint8_t out_mask, sx1509b_port_op_t flag);
//}}}
//{{{
/**
 * @brief Function for setting open drain for given port.
 *
 * @param port_num Port number.
 * @param out_mask Open drain mask.
 * @param flag     Port operation flag. @ref sx1509b_port_op_t
 *
 * @return Return error code from port config set @ref sx1509b_port_cfg_reg_set
 */
__STATIC_INLINE ret_code_t sx1509b_port_open_drain (uint8_t port_num, uint8_t out_mask, sx1509b_port_op_t flag);
//}}}
//{{{
/**
 * @brief Function for setting polarity for given port.
 *
 * @param port_num Port number.
 * @param out_mask Polarity mask.
 * @param flag     Port operation flag. @ref sx1509b_port_op_t
 *
 * @return Return error code from port config set @ref sx1509b_port_cfg_reg_set
 */
__STATIC_INLINE ret_code_t sx1509b_port_polarity (uint8_t port_num, uint8_t out_mask, sx1509b_port_op_t flag);
//}}}
//{{{
/**
 * @brief Function for setting debounce for given port.
 *
 * @param port_num Port number.
 * @param out_mask Debounce mask.
 * @param flag     Port operation flag. @ref sx1509b_port_op_t
 *
 * @return Return error code from port config set @ref sx1509b_port_cfg_reg_set
 */
__STATIC_INLINE ret_code_t sx1509b_port_debounce (uint8_t port_num, uint8_t out_mask, sx1509b_port_op_t flag);
//}}}
//{{{
/**
 * @brief Function for setting high input for given port.
 *
 * @param port_num Port number.
 * @param out_mask High input mask.
 * @param flag     Port operation flag. @ref sx1509b_port_op_t
 *
 * @retval NRF_ERROR_INVALID_PARAM Returned if there is no pin with such number.
 * @retval other                   Return error code from nrf_twi_sensor @ref nrf_twi_sensor_write
 */
ret_code_t sx1509b_port_high_input (uint8_t port_num, uint8_t out_mask, sx1509b_port_op_t flag);
//}}}
//{{{
/**
 * @brief Function for setting pull up for given port.
 *
 * @param port_num Port number.
 * @param out_mask Pull up mask.
 * @param flag     Port operation flag. @ref sx1509b_port_op_t
 *
 * @return Return error code from port config set @ref sx1509b_port_cfg_reg_set
 */
__STATIC_INLINE ret_code_t sx1509b_port_pull_up (uint8_t port_num,
                                                uint8_t           out_mask,
                                                sx1509b_port_op_t flag);
//}}}
//{{{
/**
 * @brief Function for setting pull down for given port.
 *
 * @param port_num Port number.
 * @param out_mask Pull down mask.
 * @param flag     Port operation flag. @ref sx1509b_port_op_t
 *
 * @return Return error code from port config set @ref sx1509b_port_cfg_reg_set
 */
__STATIC_INLINE ret_code_t sx1509b_port_pull_down (uint8_t port_num,
                                                  uint8_t           out_mask,
                                                  sx1509b_port_op_t flag);
//}}}
//{{{
/**
 * @brief Function for configuring the given GPIO pin number as output, hiding inner details.
 *        This function can be used to configure a pin as simple output with gate driving.
 *
 * @param pin_number Specifies the pin number.
 *
 * @note  Sense capability on the pin is disabled as the pins are configured as output.
 *
 * @return Return error code from pin config set @ref sx1509b_pin_cfg_reg_set
 */
__STATIC_INLINE ret_code_t sx1509b_pin_cfg_output (uint32_t pin_number);
//}}}

//{{{
/**
 * @brief Function for getting expander port number based on pin number.
 *
 * @retval Port number.
 */
__STATIC_INLINE uint8_t sx1509b_pin_port_decode (uint32_t pin_number);
//}}}

//{{{
/**
 * @brief Function for setting output direction on selected pins on a given port.
 *
 * @param port_num Port number.
 * @param out_mask Mask specifying the pins to set as output.
 *
 * @return Return error code from port config set @ref sx1509b_port_cfg_reg_set
 */
__STATIC_INLINE ret_code_t sx1509b_port_dir_output_set (uint8_t port_num, uint8_t out_mask);
//}}}
//{{{
/**
 * @brief Function for setting input direction on selected pins on a given port.
 *
 * @param port_num Port number.
 * @param in_mask  Mask specifying the pins to set as input.
 *
 * @return Return error code from port config set @ref sx1509b_port_cfg_reg_set
 */
__STATIC_INLINE ret_code_t sx1509b_port_dir_input_set (uint8_t port_num, uint8_t in_mask);
//}}}
//{{{
/**
 * @brief Function for writing the direction configuration of GPIO pins in a given port.
 *
 * @param port_num Port number.
 * @param dir_mask Mask specifying the direction of pins.
 *                 Bit set means that the given pin is configured as output.
 *
 * @return Return error code from port config set @ref sx1509b_port_cfg_reg_set
 */
__STATIC_INLINE ret_code_t sx1509b_port_dir_write (uint8_t port_num, uint8_t dir_mask);
//}}}
//{{{
/**
 * @brief Function for reading the direction configuration of a GPIO port.
 *
 * @param port_num Port number.
 *
 * @note  Returns 0 if port doesn't exist.
 *
 * @retval Pin configuration of the current direction settings.
 *         Bit set means that the given pin is configured as output.
 */
__STATIC_INLINE uint8_t sx1509b_port_dir_read (uint8_t port_num);
//}}}
//{{{
/**
 * @brief Function for reading the input signals of GPIO pins on a given port.
 *
 * @param port_num Port number.
 *
 * @note  Returns 0 if port doesn't exist.
 *
 * @retval Port input values.
 */
__STATIC_INLINE uint8_t sx1509b_port_in_read( uint8_t port_num);
//}}}
//{{{
/**
 * @brief Function for reading the output signals of GPIO pins of a given port.
 *
 * @param port_num Port number.
 *
 * @note  Returns 0 if port doesn't exist.
 *
 * @retval Port output values.
 */
__STATIC_INLINE uint8_t sx1509b_port_out_read (uint8_t port_num);
//}}}
//{{{
/**
 * @brief Function for writing the GPIO pins output on a given port.
 *
 * @param port_num Port number.
 * @param value Output port mask.
 *
 * @return Return error code from port config set @ref sx1509b_port_cfg_reg_set
 */
__STATIC_INLINE ret_code_t sx1509b_port_out_write (uint8_t port_num, uint8_t value);
//}}}
//{{{
/**
 * @brief Function for setting high level on selected GPIO pins of a given port.
 *
 * @param port_num Port number.
 * @param set_mask Mask with pins to set as logical high level.
 *
 * @return Return error code from port config set @ref sx1509b_port_cfg_reg_set
 */
__STATIC_INLINE ret_code_t sx1509b_port_out_set (uint8_t port_num, uint8_t set_mask);
//}}}
//{{{
/**
 * @brief Function for setting low level on selected GPIO pins of a given port.
 *
 * @param port_num Port number.
 * @param clr_mask Mask with pins to set as logical low level.
 *
 * @return Return error code from port config set @ref sx1509b_port_cfg_reg_set
 */
__STATIC_INLINE ret_code_t sx1509b_port_out_clear (uint8_t port_num, uint8_t clr_mask);
//}}}
//{{{
/**
 * @brief Function for reading pins state of multiple consecutive ports.
 *
 * @note  Due to specifics of TWI expander, pin data must be updated first
 *        to get current value @ref sx1509b_pin_data_update
 *
 * @param start_port Index of the first port to read.
 * @param length     Number of ports to read.
 * @param p_masks    Pointer to output array where port states will be stored.
 *
 * @retval NRF_ERROR_INVALID_LENGTH If trying to read more ports than available.
 * @retval NRF_SUCCESS              If operation was successful.
 */
ret_code_t sx1509b_ports_read (uint8_t start_port, uint32_t length, uint8_t * p_masks);
//}}}
//{{{
/**
 * @brief Function for reading latch state of multiple consecutive ports.
 *
 * @note  Due to specifics of TWI expander, latch data must be updated first
 *        to get current value @ref sx1509b_pin_latch_update
 *
 * @param start_port Index of the first port to read.
 * @param length     Number of ports to read.
 * @param p_masks    Pointer to output array where latch states will be stored.
 *
 * @retval NRF_ERROR_INVALID_LENGTH If trying to read more ports than available.
 * @retval NRF_SUCCESS              If operation was successful.
 */
ret_code_t sx1509b_latches_read (uint8_t start_port, uint32_t length, uint8_t * p_masks);

//}}}

