colinporth/nRF5_SDK_15.2.0/components/drivers_ext/sx1509b/sx1509b.h
//{{{
/**
 * @brief Function for reading latch state of single pin.
 *
 * @note  Due to specifics of TWI expander, latch data must be updated first
 *        to get current value @ref sx1509b_pin_latch_update
 *
 * @param  pin_number Pin number.
 *
 * @retval 0    Returned if latch is not set
 * @retval 1    Returned if latch is set.
 * @retval other Return from @ref sx1509b_pin_cfg_reg_get
 */
__STATIC_INLINE uint32_t sx1509b_pin_latch_get (uint32_t pin_number);
//}}}
//{{{
/**
 * @brief Function for clearing latch state of a single pin.
 *
 * @param pin_number Pin number.
 *
 * @return Return error code from pin config set @ref sx1509b_pin_cfg_reg_set
 */
ret_code_t sx1509b_pin_latch_clear (uint32_t pin_number);
//}}}

//{{{
/**
 * ===============================================================================================
 * @brief Led driver functions.
 */

/**
 * @brief Function enabling led driver.
 *
 * @param instance_num   Number of expander instance.
 * @param clock_internal Sets clock source.
 * @arg   true           External clock source
 * @arg   false          Internal 2Mhz clock
 * @param frequency      Frequency divider.
 * @arg   0              Led driver functionality is disabled for all IOs.
 * @arg   Else           Divider value, refer to expander documentation.
 *
 * @retval NRF_ERROR_INVALID_PARAM Returned if given instance isn't present.
 * @retval other                   Return error code from nrf_twi_sensor @ref nrf_twi_sensor_write
 */
ret_code_t sx1509b_led_driver_enable (uint8_t instance_num, bool clock_internal, uint8_t frequency);
//}}}
//{{{
/**
 * @brief Function for setting led driver mode.
 *
 * @param port_num Port for which mode will be set.
 * @param mode     Led driver mode.
 * @arg   true     Logarithmic mode
 * @arg   false    Linear mode
 *
 * @retval NRF_ERROR_INVALID_PARAM Returned if given port isn't present.
 * @retval other                   Return error code from nrf_twi_sensor @ref nrf_twi_sensor_write
 */
ret_code_t sx1509b_led_mode (uint8_t port_num, bool mode);
//}}}
//{{{
/**
 * @brief Function for setting led driver pin times.
 *
 * @param pin_number    Pin which settings will be changed.
 * @param on_time       On time of pin. Refer to expander documentation.
 * @param on_intensity  Intensity during on time. Between 0 and 255.
 * @param off_time      Off time of pin. Refer to expander documentation.
 * @param off_intensity Intensity during off time. Between 0 and 7.
 *
 * @retval NRF_ERROR_INVALID_PARAM Returned if there is no pin with given number.
 * @retval other                   Return error code from nrf_twi_sensor @ref nrf_twi_sensor_write
 */
ret_code_t sx1509b_led_pin_time (uint32_t pin_number,
                                uint8_t  on_time,
                                uint8_t  on_intensity,
                                uint8_t  off_time,
                                uint8_t  off_intensity);
//}}}
//{{{
/**
 * @brief Function for setting led driver pin fade characteristics.
 *
 * @param pin_number    Pin which settings will be changed.
 * @param fade_in       Fade in time of pin. Refer to expander documentation.
 * @param fade_out      Fade out time of pin. Refer to expander documentation.
 *
 * @retval NRF_ERROR_INVALID_PARAM Returned if given pin has no fade capability,
 *                                 or there is no pin with given number.
 * @retval other                   Return error code from nrf_twi_sensor @ref nrf_twi_sensor_write
 */
ret_code_t sx1509b_led_pin_fade (uint32_t pin_number, uint8_t fade_in, uint8_t fade_out);
//}}}
//{{{
/**
 * @brief Function for enabling led driver on selected pin.
 *
 * @param pin_number Pin number.
 *
 * @retval NRF_ERROR_INVALID_PARAM Returned if there is no pin with given number.
 * @retval other                   Return error code from nrf_twi_sensor @ref nrf_twi_sensor_write
 */
ret_code_t sx1509b_led_pin_enable (uint32_t pin_number);
//}}}
//{{{
/**
 * @brief Function for disabling led driver on selected pin.
 *
 * @param pin_number Pin number.
 *
 * @retval NRF_ERROR_INVALID_PARAM Returned if there is no pin with given number.
 * @retval other                   Return error code from nrf_twi_sensor @ref nrf_twi_sensor_write
 */
ret_code_t sx1509b_led_pin_disable (uint32_t pin_number);
//}}}
//{{{
/**
 * @brief Function for getting led driver time on register of selected pin.
 *
 * @param pin_number Pin number.
 *
 * @retval Time on led driver register of selected pin
 */
uint8_t sx1509b_led_driver_get_reg (uint32_t pin_number);
//}}}

//{{{
/**
 * @brief Function enabling key engine.
 *
 * @param instance_num  Number of expander.
 * @param rows          Number of keyboard rows.
 * @arg   <  2          Disable key engine.
 * @arg   >= 2          Number of rows (max 8).
 * @param columns       Number of columns (max 8).
 * @param sleep_time    Time of inactivity before key engine enters sleep mode.
 * @param scan_time     Scan time per column. Must be bigger than debounce time.
 * @param debounce_time Input debounce time.
 *
 * @retval NRF_ERROR_INVALID_PARAM Returned if there is no expander with given number.
 * @retval other                   Return error code from nrf_twi_sensor @ref nrf_twi_sensor_write
 */
ret_code_t sx1509b_key_engine_enable (uint8_t instance_num,
                                     uint8_t             rows,
                                     uint8_t             columns,
                                     sx1509b_key_sleep_t sleep_time,
                                     sx1509b_key_scan_t  scan_time,
                                     sx1509b_debounce_t  debounce_time);
//}}}
//{{{
/**
 * @brief Function scheduling key data update.
 *
 * @param instance_num Number of expander to update.
 * @param user_cb      Function called after key data update.
 *
 * @retval NRF_ERROR_INVALID_PARAM Returned if there is no expander with given number.
 * @retval other                   Return error code from nrf_twi_sensor @ref nrf_twi_sensor_write
 */
ret_code_t sx1509b_key_data_update (uint8_t instance_num, nrf_twi_sensor_reg_cb_t user_cb);
//}}}
//{{{
/**
 * @brief Function returning pressed key column.
 *
 * @param instance_num Number of expander.
 *
 * @retval NRF_ERROR_INVALID_PARAM Returned if there is no expander with given number.
 * @retval 0xFF                    If no key was pressed.
 * @retval 0 - 7                   Column number.
 */
uint8_t sx1509b_key_column_get (uint8_t instance_num);
//}}}
//{{{
/**
 * @brief Function returning pressed key row.
 *
 * @param instance_num Number of expander.
 *
 * @retval NRF_ERROR_INVALID_PARAM Returned if there is no expander with given number.
 * @retval 0xFF                    If no key was pressed.
 * @retval 0 - 7                   Row number.
 */
uint8_t sx1509b_key_row_get (uint8_t instance_num);
//}}}

#ifndef SUPPRESS_INLINE_IMPLEMENTATION
  //{{{
  __STATIC_INLINE ret_code_t sx1509b_pin_long_slew (uint32_t pin_number, bool set)
  {
      return sx1509b_pin_cfg_reg_set(SX1509B_REG_LONG_SLEW_B, pin_number, set);
  }
  //}}}
  //{{{
  __STATIC_INLINE ret_code_t sx1509b_pin_low_drive (uint32_t pin_number, bool set)
  {
      return sx1509b_pin_cfg_reg_set(SX1509B_REG_LOW_DRIVE_B, pin_number, set);
  }
  //}}}
  //{{{
  __STATIC_INLINE ret_code_t sx1509b_pin_open_drain (uint32_t pin_number, bool set)
  {
      return sx1509b_pin_cfg_reg_set(SX1509B_REG_OPEN_DRAIN_B, pin_number, set);
  }
  //}}}
  //{{{
  __STATIC_INLINE ret_code_t sx1509b_pin_polarity (uint32_t pin_number, bool set)
  {
      return sx1509b_pin_cfg_reg_set(SX1509B_REG_POLARITY_B, pin_number, set);
  }
  //}}}
  //{{{
  __STATIC_INLINE ret_code_t sx1509b_pin_debounce (uint32_t pin_number, bool set)
  {
      return sx1509b_pin_cfg_reg_set(SX1509B_REG_DEBOUNCE_EN_B, pin_number, set);
  }
  //}}}
  //{{{
  __STATIC_INLINE ret_code_t sx1509b_pin_level_shifter (uint32_t pin_number, sx1509b_level_shift_t set)
  {
      return sx1509b_pin_cfg_reg_set(SX1509B_REG_LEVEL_SHIFTER_1, pin_number, set);
  }
  //}}}
  //{{{
  __STATIC_INLINE ret_code_t sx1509b_port_long_slew (uint8_t port_num,
                                                    uint8_t           out_mask,
                                                    sx1509b_port_op_t flag)
  {
      return sx1509b_port_cfg_reg_set(SX1509B_REG_LONG_SLEW_B, port_num, out_mask, flag);
  }
  //}}}
  //{{{
  __STATIC_INLINE ret_code_t sx1509b_port_low_drive (uint8_t port_num,
                                                    uint8_t           out_mask,
                                                    sx1509b_port_op_t flag)
  {
      return sx1509b_port_cfg_reg_set(SX1509B_REG_LOW_DRIVE_B, port_num, out_mask, flag);
  }
  //}}}
  //{{{
  __STATIC_INLINE ret_code_t sx1509b_port_open_drain (uint8_t port_num,
                                                     uint8_t           out_mask,
                                                     sx1509b_port_op_t flag)
  {
      return sx1509b_port_cfg_reg_set(SX1509B_REG_OPEN_DRAIN_B, port_num, out_mask, flag);
  }
  //}}}
  //{{{
  __STATIC_INLINE ret_code_t sx1509b_port_polarity (uint8_t port_num,
                                                   uint8_t           out_mask,
                                                   sx1509b_port_op_t flag)
  {
      return sx1509b_port_cfg_reg_set(SX1509B_REG_POLARITY_B, port_num, out_mask, flag);
  }
  //}}}
  //{{{
  __STATIC_INLINE ret_code_t sx1509b_port_debounce (uint8_t port_num,
                                                   uint8_t           out_mask,
                                                   sx1509b_port_op_t flag)
  {
      return sx1509b_port_cfg_reg_set(SX1509B_REG_DEBOUNCE_EN_B, port_num, out_mask, flag);
  }
  //}}}
  //{{{
  __STATIC_INLINE ret_code_t sx1509b_port_pull_up (uint8_t port_num,
                                                  uint8_t           out_mask,
                                                  sx1509b_port_op_t flag)
  {
      return sx1509b_port_cfg_reg_set(SX1509B_REG_PULL_UP_B, port_num, out_mask, flag);
  }
  //}}}
  //{{{
  __STATIC_INLINE ret_code_t sx1509b_port_pull_down (uint8_t port_num,
                                                    uint8_t           out_mask,
                                                    sx1509b_port_op_t flag)
  {
      return sx1509b_port_cfg_reg_set(SX1509B_REG_PULL_DOWN_B, port_num, out_mask, flag);
  }
  //}}}
  //{{{
  __STATIC_INLINE ret_code_t sx1509b_pin_cfg_output (uint32_t pin_number)
  {
      return sx1509b_pin_cfg_reg_set(SX1509B_REG_DIR_B, pin_number, SX1509B_PIN_DIR_OUTPUT);
  }
  //}}}
  //{{{
  __STATIC_INLINE ret_code_t sx1509b_pin_cfg_watcher (uint32_t pin_number)
  {
      return sx1509b_pin_cfg_input(pin_number, SX1509B_PIN_NOPULL);
  }
  //}}}
  //{{{
  __STATIC_INLINE ret_code_t sx1509b_pin_cfg_input_disconnect (uint32_t pin_number)
  {
      return sx1509b_pin_cfg_reg_set(SX1509B_REG_INPUT_DISABLE_B, pin_number, 1);
  }
  //}}}
  //{{{
  __STATIC_INLINE ret_code_t sx1509b_pin_set (uint32_t pin_number)
  {
      return sx1509b_pin_cfg_reg_set(SX1509B_REG_DATA_B, pin_number, SX1509B_PIN_SET);
  }
  //}}}
  //{{{
  __STATIC_INLINE ret_code_t sx1509b_pin_clear (uint32_t pin_number)
  {
      return sx1509b_pin_cfg_reg_set(SX1509B_REG_DATA_B, pin_number, SX1509B_PIN_CLR);
  }
  //}}}
  //{{{
  __STATIC_INLINE ret_code_t sx1509b_pin_toggle (uint32_t pin_number)
  {
      uint8_t val = sx1509b_pin_cfg_reg_get(SX1509B_REG_DATA_B, pin_number);
      val = !val;
      return sx1509b_pin_cfg_reg_set(SX1509B_REG_DATA_B, pin_number, val);
  }
  //}}}
  //{{{
  __STATIC_INLINE ret_code_t sx1509b_pin_write (uint32_t pin_number, sx1509b_pin_set_t value)
  {
      value = (value >= 1) ? 1 : 0;
      return sx1509b_pin_cfg_reg_set(SX1509B_REG_DATA_B, pin_number, value);
  }
  //}}}
  //{{{
  __STATIC_INLINE uint32_t sx1509b_pin_read (uint32_t pin_number)
  {
      return sx1509b_pin_cfg_reg_get(SX1509B_REG_DATA_B, pin_number);
  }
  //}}}
  //{{{
  __STATIC_INLINE uint32_t sx1509b_pin_out_read (uint32_t pin_number)
  {
      return sx1509b_pin_cfg_reg_get(SX1509B_REG_DATA_B, pin_number);
  }
  //}}}
  //{{{
  __STATIC_INLINE sx1509b_pin_sense_t sx1509b_pin_sense_get (uint32_t pin_number)
  {
      return sx1509b_pin_cfg_reg_get(SX1509B_REG_SENSE_H_B, pin_number);
  }
  //}}}

