colinporth/nRF5_SDK_15.2.0/components/drivers_ext/sx1509b/sx1509b.h
  //{{{
  __STATIC_INLINE uint8_t sx1509b_pin_port_decode (uint32_t pin_number)
  {
      return pin_number / SX1509B_INNER_NEXT_BANK;
  }
  //}}}
  //{{{
  __STATIC_INLINE ret_code_t sx1509b_port_dir_output_set (uint8_t port_num, uint8_t out_mask)
  {
      return sx1509b_port_cfg_reg_set(SX1509B_REG_DIR_B, port_num, out_mask, SX1509B_PORT_CLEAR);
  }
  //}}}
  //{{{

  __STATIC_INLINE ret_code_t sx1509b_port_dir_input_set (uint8_t port_num, uint8_t in_mask)
  {
      return sx1509b_port_cfg_reg_set(SX1509B_REG_DIR_B, port_num, in_mask, SX1509B_PORT_SET);
  }
  //}}}
  //{{{
  __STATIC_INLINE ret_code_t sx1509b_port_dir_write (uint8_t port_num, uint8_t dir_mask)
  {
      return sx1509b_port_cfg_reg_set(SX1509B_REG_DIR_B, port_num, ~dir_mask, SX1509B_PORT_WRITE);
  }
  //}}}
  //{{{
  __STATIC_INLINE uint8_t sx1509b_port_dir_read (uint8_t port_num)
  {
      return ~sx1509b_port_cfg_reg_get(SX1509B_REG_DIR_B, port_num);
  }
  //}}}
  //{{{
  __STATIC_INLINE uint8_t sx1509b_port_in_read (uint8_t port_num)
  {
      return sx1509b_port_cfg_reg_get(SX1509B_REG_DATA_B, port_num);
  }
  //}}}
  //{{{
  __STATIC_INLINE uint8_t sx1509b_port_out_read (uint8_t port_num)
  {
      return sx1509b_port_cfg_reg_get(SX1509B_REG_DATA_B, port_num);
  }
  //}}}
  //{{{
  __STATIC_INLINE ret_code_t sx1509b_port_out_write (uint8_t port_num, uint8_t value)
  {
      return sx1509b_port_cfg_reg_set(SX1509B_REG_DATA_B, port_num, value, SX1509B_PORT_WRITE);
  }
  //}}}
  //{{{
  __STATIC_INLINE ret_code_t sx1509b_port_out_set( uint8_t port_num, uint8_t set_mask)
  {
      return sx1509b_port_cfg_reg_set(SX1509B_REG_DATA_B, port_num, set_mask, SX1509B_PORT_SET);
  }
  //}}}
  //{{{
  __STATIC_INLINE ret_code_t sx1509b_port_out_clear( uint8_t port_num, uint8_t clr_mask)
  {
      return sx1509b_port_cfg_reg_set(SX1509B_REG_DATA_B, port_num, clr_mask, SX1509B_PORT_CLEAR);
  }
  //}}}
  //{{{
  __STATIC_INLINE uint32_t sx1509b_pin_latch_get (uint32_t pin_number)
  {
      return sx1509b_pin_cfg_reg_get(SX1509B_REG_INT_SRC_B, pin_number);
  }
  //}}}
#endif

//{{{
#ifdef __cplusplus
}
#endif
//}}}
